src/main/resources/probe-template.xml


<soap:Envelope
	xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
	xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
	xmlns:tns="http://schemas.xmlsoap.org/ws/2005/04/discovery">
	<soap:Header>
		<wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/Probe</wsa:Action>
		<wsa:MessageID>urn:uuid:c032cfdd-c3ca-49dc-820e-ee6696ad63e2</wsa:MessageID>
		<wsa:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To>
	</soap:Header>
	<soap:Body>
		<tns:Probe />
	</soap:Body>
</soap:Envelope>